# NTP, Syslog server

SRV1: Syslog server 

SRV2: NTP server 192.168.1.8

```bash
! NTP
R1> enable
R1# configure terminal
R1(config)#
R1(config)# ntp server 192.168.1.8
R1(config)# do show clock
R1(config)# npt update-calendar
R1(config)# do show clock
R1(config)# 

! authentication

R1(config)# ntp authenticate 
R1(config)# ntp authentication-key 1 md5 Ntp123
R1(config)# ntp trusted-key 1

! syslog
R1(config)# logging 192.168.1.7
R1(config)# logging on
R1(config)# 
R1(config)# int s0/0/0

! test syslog service
R1(config-if)# shutdown
R1(config-if)# no shutdown
! check messages on syslog server

! finetuning
R1(config)# service timestamps log datetime msec
```

Alright, let's go through this carefully â€” your script configures a **Cisco router** (R1) to use **NTP** (Network Time Protocol) for time synchronization and a **Syslog server** for centralized logging. Here's what each block does:

---

### 1. **NTP Configuration**

```bash
R1> enable
R1# configure terminal
```
- Enter **privileged mode** (`enable`) and then **global configuration mode** (`configure terminal`).

```bash
R1(config)# ntp server 192.168.1.8
```
- Tell the router to **synchronize its clock** with the **NTP server** at IP `192.168.1.8` (your `SRV2`).

```bash
R1(config)# do show clock
```
- **Check the routerâ€™s clock** to see the current time (before or after NTP sync).

```bash
R1(config)# ntp update-calendar
```
- **Update the router's hardware clock** (calendar) with the newly synchronized NTP time.  
  (Important because some devices have a software clock and a separate hardware clock.)

```bash
R1(config)# do show clock
```
- **Verify again** if the clock is correct.

---

### 2. **NTP Authentication (Optional but Recommended for Security)**

```bash
R1(config)# ntp authenticate
```
- Enable **NTP authentication** (makes sure that only trusted servers are accepted).

```bash
R1(config)# ntp authentication-key 1 md5 Ntp123
```
- Define a **key** (`key 1`) with **MD5** encryption and password `"Ntp123"`.  
  (This key must match on both the NTP server and client!)

```bash
R1(config)# ntp trusted-key 1
```
- Tell the router that **key 1** is trusted for NTP associations.

---

### 3. **Syslog Server Configuration**

```bash
R1(config)# logging 192.168.1.7
```
- Set **192.168.1.7** (`SRV1`) as the **Syslog server** to receive log messages.

```bash
R1(config)# logging on
```
- Enable **logging functionality** (just setting the server isn't enough without turning logging on).

---

### 4. **Testing Syslog**

```bash
R1(config)# int s0/0/0
```
- Go to interface **Serial 0/0/0** (could be any interface).

```bash
R1(config-if)# shutdown
```
- **Disable** the interface (this should generate a Syslog event like "Interface Down").

```bash
R1(config-if)# no shutdown
```
- **Re-enable** the interface (generating another Syslog message "Interface Up").

> âž” After this, you should **see these logs appear on your Syslog server**.

---

### 5. **Fine-Tuning Log Timestamps**

```bash
R1(config)# service timestamps log datetime msec
```
- Configure **detailed timestamps** for logs, showing **date, time, and milliseconds**.  
  (Without this, logs might not have precise timestamps.)

---

### âœ¨ Summary of What This Does

| Part         | Action                                                  |
|--------------|----------------------------------------------------------|
| NTP          | Syncs router time securely with `192.168.1.8`            |
| Syslog       | Sends router logs to server at `192.168.1.7`             |
| Testing      | Shutting down and enabling interface triggers log events |
| Fine-tuning  | Adds precise time (with milliseconds) to log entries     |

---

Would you also like a little visual diagram showing the connections (R1 â†’ NTP server + Syslog server)? It can make it even clearer! ðŸ“ˆ