
```bash
R1(config)# router ospf 1 
R1(config-router)# no passive gi0/1
R1(config-router)# passive gi0/1.10
R1(config-router)# passive gi0/1.20
R1(config-router)# passive gi0/1.50
R1(config-router)# exit
R1(config)# 
```

Good â€” you're asking about **this OSPF configuration**:

Let's **explain it carefully step-by-step**:

---

# ðŸ”µ What you're doing:

```bash
R1(config)# router ospf 1 
```
- Enter OSPF process 1.
- This is where you configure OSPF settings.

---

```bash
R1(config-router)# no passive gi0/1
```
- **Remove passive mode** from **physical interface gi0/1**.
- Meaning: OSPF **will send Hello packets** (form neighbor relationships) out of gi0/1.
- âš¡ *This is important because your switch (if it speaks OSPF) or router neighbor needs to hear OSPF Hellos.*

---

```bash
R1(config-router)# passive gi0/1.10
R1(config-router)# passive gi0/1.20
R1(config-router)# passive gi0/1.50
```
- **Make the subinterfaces passive**.
- Meaning: OSPF will **advertise the network**, but **WILL NOT send Hello packets** out these subinterfaces.
- These subinterfaces (VLAN 10, 20, 50) **connect only to end devices (PCs, Servers)** â€” no routers are there, so no need for Hello packets.
- ðŸ”’ *This is good security and good practice!* (Stops unnecessary OSPF traffic.)

---

```bash
R1(config-router)# exit
```
- Leave OSPF router configuration mode.

---

# ðŸŽ¯ **Why is this a good idea?**

- Only **gi0/1** is active for neighbor discovery (good).
- Subinterfaces **only advertise their networks** (no wasted Hello traffic).
- Protects end-user ports from weird OSPF behavior or attacks.
- Improves performance slightly (less unnecessary traffic).

---

# ðŸ“œ **In simple words:**

| Interface         | Behavior            | Purpose                                 |
|-------------------|----------------------|-----------------------------------------|
| gi0/1             | **Active**            | OSPF neighbor discovery and routing.   |
| gi0/1.10 (VLAN 10) | **Passive**           | Advertise network only. No Hellos.      |
| gi0/1.20 (VLAN 20) | **Passive**           | Advertise network only. No Hellos.      |
| gi0/1.50 (VLAN 50) | **Passive**           | Advertise network only. No Hellos.      |

---

Would you also like me to show **a version using `passive-interface default`** which is even **faster and more secure**? ðŸš€  
(*You only need 1 line to make everything passive, then un-passthrough the one you want!*)